[
    {
        "genres": [
            "Electronic"
        ],
        "artist": "Arp",
        "releaseDate": "2018-06-22",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Mojo",
                "date": "2018-08-14",
                "content": "A sweet, herbal fug hanging over proceedings, Zebra joins the dots between blissed-out Balearica, trippy kosmische, Eastern and Afro vibes and spacey jazz. [Sep 2018, p.91]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Guardian",
                "date": "2018-06-22",
                "content": "It is truly cosmic music, one that defies categorisation.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": "2018-06-21",
                "content": "There's a lot going on but Georgopoulos makes it all feel unhurried and effortless. [Aug 2018, p.24]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2018-06-29",
                "content": "In reaching out to others, Georgopoulos is discovering his own voice for the first time.",
                "score": 76
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Under The Radar",
                "date": "2018-06-21",
                "content": "Zebra represents Georgopoulos's minimalism at its most luxurious--a near hour-long expanse of adroit architecture and rhythmic topography.",
                "score": 75
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2018-06-21",
                "content": "As unconventional as it is relaxing, Zebra is perhaps Arp's most inviting sound-world yet.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": "2018-06-21",
                "content": "Zebra finds Georgopoulos in purely instrumental mode, boundary-blurring jazz, African, Balearic and kosmische influences with mixed results. [Summer 2018, p.106]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": "2018-09-11",
                "content": "There is a very fine line between contentment and the utter absence of feeling, and while Zebra's production and mix is flawless throughout, it falls too often on the wrong side of that line.",
                "score": 50
            }
        ],
        "title": "ZEBRA"
    },
    {
        "genres": [
            "Electronic",
            "Techno",
            "Downbeat",
            "Experimental Techno"
        ],
        "artist": "Boom Bip",
        "releaseDate": "2011-09-27",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Boston Phoenix",
                "date": "2011-10-04",
                "content": "The 10-minute penultimate track \"Tumtum,\" in particular, is a tiny masterpiece of mood, stamina, and insistent rhythm, built sparingly on overlapping percussion and waves of sound. More of this kind of thing is what will squeak Boom Bip farther from the then and the now, and closer to what comes afterward.",
                "score": 75
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Wire",
                "date": "2011-12-06",
                "content": "Abstract hiphop-heads might be turned off by the slick machismo, but others will have some good dirty fun. [Oct 2011, p.65]",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "BBC Music",
                "date": "2011-09-27",
                "content": "Zig Zaj is predictably unpredictable, something else again for the artist.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2011-09-27",
                "content": "Zig Zaj sounds more like a rehash than the entirely new recipe that music fans are undoubtedly looking for.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2011-09-27",
                "content": "Zig Zaj feels like he's straining a little too hard to make every song different from the last, where he's actually become pinned down by the \"eclectic\" reputation he's accrued, forcing him to make unwise decisions just to keep a certain degree of diversity afloat in his work.",
                "score": 66
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Under The Radar",
                "date": "2011-11-09",
                "content": "Although Zig Zaj has a couple of strong songs that will likely find good homes on public radio and progressive dance floors, it sounds more like a collection of individual tracks than an actual album. [Oct. 2011, p. 112]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": "2011-11-08",
                "content": "This third full-length solo record is a rich blend of different genres that, despite its rampant eclecticism, never jars. [Nov. 2011, p. 128]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": "2011-10-03",
                "content": "[It is] an eclectic patchwork of cinematic techno-rock and beat-heavy vocal tunes featuring stray members of the Chili Peppers, Warpaint and more. [Oct 2011, p.81]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Mojo",
                "date": "2011-09-27",
                "content": "Zig Zaj corrals its celebrity cameos within a strictly ring-fenced aesthetic. [Oct 2011, p.98]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Dusted Magazine",
                "date": "2011-10-18",
                "content": "The end result lumps the worst banalities of \"indie\" music into electronic sounds that, if properly fleshed out, might have been interesting.",
                "score": 50
            }
        ],
        "title": "Zig Zaj"
    },
    {
        "genres": [
            "Electronic",
            "Club/Dance",
            "Indie Electronic",
            "Alternative Dance"
        ],
        "artist": "Cut Copy",
        "releaseDate": "2011-02-08",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Consequence",
                "date": "2011-02-23",
                "content": "In fact, it's very hard to determine what the actual standout from this album will be, because literally every track is full to the absolute brim with the genius of seasoned veterans",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Urb",
                "date": "2011-02-03",
                "content": "The refreshing thing about bands like Cut Copy is that they're consistent. Far too often do artists change direction throughout their careers and sometimes lose touch with that thing that made us all fall in love with them in the first place, but this isn't the case with Zonoscope.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2011-02-07",
                "content": "Compared to the last two albums, Zonoscope has precious little guitar crunch, which makes it hard to even call Cut Copy a dance-rock band anymore.",
                "score": 86
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "cokemachineglow",
                "date": "2011-02-07",
                "content": "I'm elated to report that Zonoscope is a more than worthy successor to Colours, adhering to the tried and true follow-up formula of introducing just enough new wrinkles to their method to keep the proceedings from being a rehash, but containing plenty of the rapturous pop hooks that drew us to them in the first place.",
                "score": 84
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Paste Magazine",
                "date": "2011-02-07",
                "content": "Cut Copy are deceptively complex, even at their hookiest.",
                "score": 82
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Under The Radar",
                "date": "2011-02-18",
                "content": "Owing a debt of gratitude to every 1970s police show theme song in existence, Cut Copy blends all their influences into a multi-movement haze of electronics, creating a perfect album send-off. Hit repeat and keep the good times rolling.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2011-02-08",
                "content": "Thanks to its beauty, warmth, and top-rate songwriting, Cut Copy remain atop the pile of dance-rock groups in 2011, right next to LCD Soundsystem. Thanks to its beauty, warmth, and top-rate songwriting, Cut Copy remain atop the pile of dance-rock groups in 2011, right next to LCD Soundsystem.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Spin",
                "date": "2011-02-08",
                "content": "The record works best at its most focused and extroverted.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "NOW Magazine",
                "date": "2011-02-07",
                "content": "It's Cut Copy's most textured and rhythmically complex record, and also irresistible in its emotional simplicity.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "musicOMH.com",
                "date": "2011-02-07",
                "content": "It's another step nearer the masterpiece this band are increasingly capable of delivering.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Drowned In Sound",
                "date": "2011-02-07",
                "content": "Sure, there are those who might be after an In Ghost Colours part two who might be alienated by this album's evident ambition, but for most of us, this is going to be a serious upping of the game.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Los Angeles Times",
                "date": "2011-02-15",
                "content": "There aren't too many new stones in the pop garden that Cut Copy overturns, but what it roots out is expertly arranged, creating pastiches that raise ghosts from the past while capturing a spirit that's utterly now.",
                "score": 75
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Billboard.com",
                "date": "2011-03-04",
                "content": "Cut Copy thrives when the ingredients are simple: melody, voice and its influences interpreted.",
                "score": 72
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "No Ripcord",
                "date": "2011-02-18",
                "content": "Cut Copy are back, and back with enough danceable synth-pop to flatten the sensitive Bombay Bicycle Club member in all of us - but only just enough.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "BBC Music",
                "date": "2011-02-14",
                "content": "While not quite the amazing leap that Cut Copy made from Bright Like Neon Love to In Ghost Colours, Zonoscope is by no means a bad album. But it is one that will probably sound better when wafting across a field during festival season.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": "2011-02-09",
                "content": "Zonoscope is a deviation with mostly good ideas, some great ones, and enough sparkling synth ambrosia and sing-along chorus hooks to get you through.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "CMJ",
                "date": "2011-02-08",
                "content": "With few exceptions, these are a solid collection of dance-rock songs and rock-dance tracks-Zonoscope represents the evolution of a band that knows what it's doing.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Prefix Magazine",
                "date": "2011-02-07",
                "content": "They've all called Zonoscope less poppy and more meandering. That's not necessarily the entire case here, but don't doubt the band on this: there are fewer big singles here, and this one isn't likely to spawn multiple indie hits months after its release like the last album.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Slant Magazine",
                "date": "2011-02-07",
                "content": "Zonoscope's extensive flirtation with last year's vogue is the most obvious sense in which Cut Copy fails to establish a sonic identity of their own.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Delusions of Adequacy",
                "date": "2011-02-07",
                "content": "Clocking in at just a shade over an hour, Zonoscope is – as its cover art of Manhattan being engulfed by a waterfall suggests – a very surreal leviathan, an object that surely mesmerizes as we all wait for the oncoming Armageddon.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Beats Per Minute",
                "date": "2011-02-15",
                "content": "Sure Zonoscope is splattered with stumbled-upon gems, but a little more editing and maybe some more focused songwriting sessions could have really brought Zonoscope into focus.",
                "score": 69
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Chicago Tribune",
                "date": "2011-02-08",
                "content": "When Zonoscope sticks to concise songcraft, it's a satisfying, if sometimes trifling, pleasure.",
                "score": 63
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": "2011-05-02",
                "content": "Take Me Over makes a misplaced attempt at funk, which grates slightly, but it's hard to dislike the well tuned synths and dreamy choruses of tracks such as Hanging Onto Every Heartbeat. [Apr 2011, p.101]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Alternative Press",
                "date": "2011-02-23",
                "content": "Like most everything else here, it's a dancing no-brainer. [Mar 2011, p.92]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Guardian",
                "date": "2011-02-11",
                "content": "They throw the kitchen sink into Sun God, a 15-minute odyssey somewhere between LCD Soundsystem and disco, which could probably liven up any living room into an Aussie beach party.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Clash Music",
                "date": "2011-02-09",
                "content": "Things are a little different now but like many of their contemporaries, Cut Copy have had to adapt to the landscape and Zonoscope is a considered attempt at a more kaleidoscopic approach.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Rolling Stone",
                "date": "2011-02-08",
                "content": "Australian synth-pop quartet Cut Copy do the Eighties eerily well. Too well, in fact. Cue up the band's third album, and you find yourself playing spot-the-influence.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Tiny Mix Tapes",
                "date": "2011-02-04",
                "content": "Zonoscope is far from an outright failure, just more severe of a backslide than expected.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Boston Phoenix",
                "date": "2011-02-16",
                "content": "The contrived sheen marring much of the album dissolves, and things get industrial real quick. That dark and uncharted - for Cut Copy - territory might be the way to go heading forward.",
                "score": 50
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "New Musical Express (NME)",
                "date": "2011-02-07",
                "content": "After the ubiquitous presence of '80s-indebted music last year, a follow-up with little stylistic deviation isn't a thrilling proposition: Take Me Over steals a hook from fellow Australians Men At Work, adds ooh-ooh backing vocals and just about gets away with it.",
                "score": 50
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": "2011-04-13",
                "content": "This is departure lounge pop--antiseptic, pleasant, with Photoshopped pics of exotic locales scattered around, but none of the hedonism of actually being there. [May 2011, p.82]",
                "score": 40
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-02-10",
                "content": "Consistency/innovative/dance-rock inspiring electro pop. Cut Copy is 3 for 3 on career albums and Zonoscope adds a great topping to the trilogy of musical euphoria.  If you were expecting In Ghost Colours part 2 with hit after hit, CC responded with this new record full of organic new sounds and they passed with flying colours.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-02-19",
                "content": "More dance and less rock than previous albums, but I think this is the best cut copy album yet, and well worth a listen.  They won't lose any old fans with this album, and I think they will gain new fans as well.  Only complaint is some songs go very long with little change in the repetition, but all the better to dance to at your end of the world party right?",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-02-12",
                "content": "After the stellar dance-rock album \"In Ghost Colours\", I guess they decided to phone this one in.  It is so soaked in all the left over, 80's synth garbage (OMD, New Order and Depeche Mode) that no one has bothered to meddle in to this point, leaving the entire venture pretty stale.  Certainly there are a few dance-able tracks here and there, yet there is minimal to no rock influences thisAfter the stellar dance-rock album \"In Ghost Colours\", I guess they decided to phone this one in.  It is so soaked in all the left over, 80's synth garbage (OMD, New Order and Depeche Mode) that no one has bothered to meddle in to this point, leaving the entire venture pretty stale.  Certainly there are a few dance-able tracks here and there, yet there is minimal to no rock influences this time around and most of all, the tone and tempo of leader singer Whitford's vocals are beyond boring.  I've always felt their previous work sounded extremely spontaneous, fun and still provided uniquely interesting structures like no one else; \"Zonoscope\" shows another side of Cut Copy: unimaginative, non-unique and flat.  Better luck next time...… Expand",
                "score": 4
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-03-10",
                "content": "Well...I had a lot of trouble making it through this album. It's pretty bland/boring, and no one song really jumps out. I suppose it would make good background music (noise) but other than that I think they lack spark and energy.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-03-21",
                "content": "Is this as good as \"In Ghost Colours\"? No. But that in no way means that this is a bad release by any means. There most definitely is a 80's synth vibe going on and I think they hit the mark for the most part. It's tough for a sophomore album to stand out when the debut release was so strong but that being said I think they hit the nail on the head.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-04-26",
                "content": "doesn't have the rock/dance feel that made 'In Ghost Colors' so good but an awesome album in its own right.  A lot of depth and so many good songs with great progression.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-06-20",
                "content": "Each song on its own is great but together i think there's a bit too much variation, jumping from one style and influence to another in quick succession. Sure, some of the great records are incredibly variable, but they don't change so abruptly and fuse their influences better than Cut Copy have done. Some superb songs though such as Take Me Over, Where I'm Going, Need You Now and BlinkEach song on its own is great but together i think there's a bit too much variation, jumping from one style and influence to another in quick succession. Sure, some of the great records are incredibly variable, but they don't change so abruptly and fuse their influences better than Cut Copy have done. Some superb songs though such as Take Me Over, Where I'm Going, Need You Now and Blink And You'll Miss A Revolution.… Expand",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-06-23",
                "content": "The album feels forced in a number of areas. One example of this is the presence of tropical percussion instruments in several songs; these instruments end up sounding like clutter in most of the songs they appear in, with one notable exception being \"Corner of the Sky.\" The strongest parts of the album make extensive use of electronic/synth sounds and instruments, while the weakest partsThe album feels forced in a number of areas. One example of this is the presence of tropical percussion instruments in several songs; these instruments end up sounding like clutter in most of the songs they appear in, with one notable exception being \"Corner of the Sky.\" The strongest parts of the album make extensive use of electronic/synth sounds and instruments, while the weakest parts make use of sounds and instruments that are more \"organic\" (e.g. guitar, tropical percussion instruments, etc.). The best song on the album is \"Pharaohs and Pyramids,\" but \"Where I'm Going,\" \"Hanging Onto Every Heartbeat,\" \"Corner of the Sky,\" and \"Sun God\" are all relatively strong compared to the other songs on the album.… Expand",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-12-24",
                "content": "This album was Cut copy's next step out of their lets-bring-disco-back phase. Let's just say nostalgia doesn't necessarily mean good. I've always enjoyed Dan Whitford's vocals which persuaded me to purchase this album. I'm not going to say it was great because I only enjoyed the unique synthetic noises used throughout these tracks. I think it's safe to say Cut-Copy was a lot moreThis album was Cut copy's next step out of their lets-bring-disco-back phase. Let's just say nostalgia doesn't necessarily mean good. I've always enjoyed Dan Whitford's vocals which persuaded me to purchase this album. I'm not going to say it was great because I only enjoyed the unique synthetic noises used throughout these tracks. I think it's safe to say Cut-Copy was a lot more experimental with this album in comparison to \"In Ghost Colours\".… Expand",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2012-06-12",
                "content": "You'll be mindblowed since the first note of \"Need You Now\" and the effects' fade-out on the epic \"Sun God\". These songs are more drawn to the experimentalism from Animal Collective, but it still got some great dance songs, such as \"Blink And You'll Miss The Revolution\" and \"Corner Of The Sky\". But the pop songs are worth mentioning too, like \"Alisa\" and \"Where I'm Going\".",
                "score": 9
            }
        ],
        "title": "Zonoscope"
    },
    {
        "genres": [
            "Electronic",
            "Club/Dance",
            "Alternative R&B"
        ],
        "artist": "JETS",
        "releaseDate": "2019-05-24",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": "2019-06-06",
                "content": "Throughout the pair continually take the road less traveled, yet somehow manage to both steer and navigate at the same time. The result is, at times, a stunningly inventive album that, thankfully, delivers on its promises.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2019-06-06",
                "content": "Zoospa’s musical elements feel cohesive, even as they bounce across genres and eras, often within the same song.",
                "score": 75
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Resident Advisor",
                "date": "2019-06-06",
                "content": "It's not a splashy supergroup album, nor is it perfect. It's the work of two experienced producers producing sharp songs. Like all of Edgar and Stewart's work as J-E-T-S, Zoospa is impressive but surprisingly low-key.",
                "score": 74
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2019-06-06",
                "content": "Throughout the album, the duo maintain a balance between daring production tricks and direct feelings, producing futuristic experimental pop that builds on the two producers' combined histories while pushing things further.",
                "score": 70
            }
        ],
        "title": "Zoospa"
    },
    {
        "genres": [
            "Electronic",
            "Pop/Rock",
            "Club/Dance"
        ],
        "artist": "King of the Mountains",
        "releaseDate": "2014-04-29",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Line of Best Fit",
                "date": "2014-05-21",
                "content": "Zoetrope manages to ably explore both shades of contemporary electronic music; the house-tinged, ecstasy laden cracks of one school and the strokey beard experimentations of the other.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The 405",
                "date": "2014-05-21",
                "content": "The best place to file Zoetrope would probably be on the shelf marked 'albums worth a punt if you have a few bob spare'.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": "2014-05-21",
                "content": "The results ate at once intimate and expansive, layering vintage synthesizer riffs over fidgety percussion. [Jun 2014, p.112]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "musicOMH.com",
                "date": "2014-05-21",
                "content": "What King Of The Mountains manages to achieve isn’t particularly new but there’s a fair amount of admirable craft going on that doesn’t come across as too robotic or synthetic. But it feels too safe, and lacks cohesion and structure.",
                "score": 60
            }
        ],
        "title": "Zoetrope"
    },
    {
        "genres": [
            "Electronic"
        ],
        "artist": "Schneider TM",
        "releaseDate": "2002-08-20",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": null,
                "content": "Zoomer is a very, very good album, but one thing it makes clear is that the songwriting aspect of this sort of lap[pop] hybrid must continue to improve.",
                "score": 85
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": null,
                "content": "The album's eight supple, textured tunes suggest Cornelius stripped of his art-jazz awkwardness, or even the molten sugar rush of My Bloody Valentine slowed to a beatific calm. [Nov 2002, p.128]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Magnet",
                "date": null,
                "content": "It's as if Steve Miller and the Beach Boys got together, sacked the session players and sang over breakbeats and a thicket of digital clicks and clacks. [#56, p.105]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Urb",
                "date": null,
                "content": "A wacky landmark in the electronic pop movement. [Nov 2002, p.98]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": null,
                "content": "One of the best young producers going in electronic music.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Wire",
                "date": null,
                "content": "May be the year's most surprising pure pop pleasure--precisely because it's nothing like you'd expect a pop album to be. [#224, p.61]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Splendid",
                "date": null,
                "content": "Zoomer has a warmth and spirit that makes the work endearing as actual songs rather than chunks of carefully manipulated data.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Mojo",
                "date": null,
                "content": "Another masterfully blended cocktail of restless electronic beats, analogue daubings and digitally blasted vocals. [Nov 2002, p.110]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Launch.com",
                "date": null,
                "content": "With harmonies that could have been stolen from Pet Sounds altered by Aphex Twin or Squarepusher, Zoomer is the perfect way to introduce pre-school tots to techno-pop pleasures.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Almost Cool",
                "date": null,
                "content": "It's a much breezier affair, as if Air and Daft Punk have been cross-bred with The Notwist and Mouse On Mars.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Stylus Magazine",
                "date": null,
                "content": "It can safely be said that Dresselhaus has nothing to learn about the instruments of technology, but a lot to learn about the ability to write a catchy tune.",
                "score": 53
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Village Voice",
                "date": null,
                "content": "At times it's a bit like a post-techno Jesus and Mary Chain, burying tambourine rattle and two-chord bangers beneath an avalanche of clicks and static.",
                "score": 50
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": null,
                "content": "There is certainly no doubt about Dresselhaus' knack for the keystroke. He takes pins and needles of sound and builds rather interesting fields. But it's the additional elements that he drags into each track that end up running him in circles.",
                "score": 40
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": null,
                "content": "Half of Zoomer suggests Beck being produced by Aphex Twin, but elsewhere his flimsy songwriting is drowned out by percussive clatter. [Nov 2002, p.106]",
                "score": 40
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2004-06-19",
                "content": "Pure genius. A little top heavy, but still worth at least an 85.",
                "score": 10
            }
        ],
        "title": "Zoomer"
    },
    {
        "genres": [
            "Electronic"
        ],
        "artist": "Wolfgang Voigt",
        "releaseDate": "2013-09-02",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "XLR8r",
                "date": "2013-12-05",
                "content": "Zunkuft may be even more sleep-inducing than the average ambient album, but it's worth admiring for its robust, and not humorless, conceptual solidity.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Exclaim",
                "date": "2013-12-05",
                "content": "The music lacks the sheer immensity that must have graced it originally, as it's virtually impossible to recreate something so grand at home.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": "2013-12-05",
                "content": "Voigt has creative skill, and he’s using it on Zukunft Ohne Menschen. It’s just that, in order to fully listen to it, you probably have to see it.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Tiny Mix Tapes",
                "date": "2013-12-05",
                "content": "Completists will appreciate the ability to experience the Art Cologne installation in the convenience of their own home, but everyone else should have no trouble finding more compelling examples of this theme, from the most difficult noise music to the most pleasant synth-pop.",
                "score": 50
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2013-12-05",
                "content": "Unlike so much of Voigt's past work, it's not an idea worth exploring at this length. Zukunft's only impressive feat is making Voigt's elegant, pristine work under guises like Studio 1 and Gas seem like the work of a raving, impassioned romantic.",
                "score": 44
            }
        ],
        "title": "Zukunft Ohne Menschen"
    },
    {
        "genres": [
            "Indie",
            "Rock"
        ],
        "artist": "Eleventh Dream Day",
        "releaseDate": "2006-04-25",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": null,
                "content": "Zeroes and Ones is probably the album that best showcases all sides of Eleventh Dream Day, and might just be their best album yet.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": null,
                "content": "If it’s your first Eleventh Dream Day record, you’ve picked a great starting point.  If it’s your tenth, you won’t be disappointed.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": null,
                "content": "A fearsome blast. [Jun 2006, p.100]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Dusted Magazine",
                "date": null,
                "content": "Zeroes and Ones, like Eleventh Dream Day’s early work, has the direct, immediate quality of a live performance.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": null,
                "content": "Unfortunately, these tracks don't have the charm of their more traditional jangle-rock, and at times the disc suffers for it.",
                "score": 64
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Delusions of Adequacy",
                "date": null,
                "content": "A solid yet underachieving return.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": null,
                "content": "There's nothing desperately new here, but it's all sharply enough executed. [Jun 2006, p.114]",
                "score": 60
            }
        ],
        "title": "Zeroes And Ones"
    },
    {
        "genres": [
            "Indie",
            "Rock"
        ],
        "artist": "Ex Models",
        "releaseDate": "2003-05-27",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": null,
                "content": "Zoo Psychology's refrains are faster, shorter, and more efficient than ever.",
                "score": 82
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Alternative Press",
                "date": null,
                "content": "Ex Models make the cleanest and most non-metal racket you're likely to find. [Jul 2003, p.113]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Magnet",
                "date": null,
                "content": "It sounds like a war against music. [#60, p.97]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Dusted Magazine",
                "date": null,
                "content": "Ex Models are not afraid of the gaps created by their minimal approach; they use the silence to contrast the unholy racket they can make.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Delusions of Adequacy",
                "date": null,
                "content": "Zoo Psychology is gritty, and crazy, and at times, almost maddening.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Splendid",
                "date": null,
                "content": "This is an odd album, weirdly compelling and madly frustrating.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Rolling Stone",
                "date": null,
                "content": "A very loud, very strange and playfully destructive album.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Stylus Magazine",
                "date": null,
                "content": "Zoo Psychology is a phenomenal 20-minute experience, if only for its sheer insanity. The songs aren\u0092t consistently strong enough for it to be remembered too long down the road, but it does make for a thrilling listen.",
                "score": 68
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Mojo",
                "date": null,
                "content": "Whether this leaves you head-scratching or dancing like an electrified monkey, it certainly won't bore you. [Jul 2003, p.109]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": null,
                "content": "This band is awfully good at being annoying.",
                "score": 60
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-07",
                "content": "This is the craziest pop record ever. Yes P-O-P.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2003-07-04",
                "content": "With the new wave of hipster NY bands of late, these guys lack both the fashion and the substance. Technicality can't buy you cred when it's so bloody dull and innocuous.",
                "score": 1
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-01",
                "content": "This album manages to make a bunch of annoying genres catchy. Too bad it's too good to be hip.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2003-07-04",
                "content": "Um, shite...get into Meshuggah instead.",
                "score": 3
            }
        ],
        "title": "Zoo Psychology"
    },
    {
        "genres": [
            "Indie",
            "Rock"
        ],
        "artist": "My Morning Jacket",
        "releaseDate": "2005-10-04",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Mojo",
                "date": null,
                "content": "With Z, My Morning Jacket have left their comfort zone, assumed the mantle of firebrands, and delivered a truly momentous work. [Oct 2005, p.96]",
                "score": 100
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The A.V. Club",
                "date": null,
                "content": "It's both rare and marvelous to hear a good band make its first really great album.",
                "score": 100
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Alternative Press",
                "date": null,
                "content": "Z is their OK Computer, an album of scope and resonance that lasts far longer than its 40-minute run-time. [Oct 2005, p.162]",
                "score": 100
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Filter",
                "date": null,
                "content": "Z is a great record--more expansive than its predecessors and less tunnel-visioned too. [#17, p.94]",
                "score": 93
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Spin",
                "date": null,
                "content": "In spite of all their stony sonic exploration, they never let Z turn into Zzzz. [Oct 2005, p.133]",
                "score": 91
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Entertainment Weekly",
                "date": null,
                "content": "They evoke the musical essence of various titans while achieving a wholly distinctive sound of their own. [7 Oct 2005, p.73]",
                "score": 91
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "E! Online",
                "date": null,
                "content": "Z seems like just the beginning of a whole new phase.",
                "score": 91
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Dot Music",
                "date": null,
                "content": "A modern day classic.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": null,
                "content": "[A] triumphant resurrection. [Nov 2005, p.96]",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "New Musical Express (NME)",
                "date": null,
                "content": "By balancing progression with consolidation, technology with tradition, MMJ have created a work of stunningly expansive ambition. [15 Oct 2005, p.36]",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": null,
                "content": "Z is intuitive, intensely creative, classicist-minded, nearly flawless.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Trouser Press",
                "date": null,
                "content": "This music has the serene lilt of pop and the hope of sentimentality but also the gravity of unconventional responsibility. Rather than roaring, this music sears.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Billboard",
                "date": null,
                "content": "A bold leap forward. [8 Oct 2005]",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Prefix Magazine",
                "date": null,
                "content": "By trimming thirty minutes off their standard record’s length, the members of My Morning Jacket have paradoxically managed to broaden their sound, cutting the fat to give us ten songs that jive, moon-walk and cock-rock in equal measure.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "ShakingThrough.net",
                "date": null,
                "content": "Yes, it may not hew faithfully to past MMJ records, but its wide-open range perfectly exemplifies the group's adventurous spirit.",
                "score": 88
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Los Angeles Times",
                "date": null,
                "content": "\"Z\" moves away from the more overt Band and \"The Notorious Byrd Brothers\" references, closer to a convergence of Who-like playfulness and drive with R.E.M. mystery. [2 Oct 2005]",
                "score": 88
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Lost At Sea",
                "date": null,
                "content": "MMJ’s musical palate has radically expanded: the reverb and alt-country trappings remain, but they no longer dominate the band’s aesthetic. In nodding to U2, John McLaughlin, Sunny Day Real Estate, Mercury Rev, The Clash and countless other icons through a holistic approach to the pop canon, James and his band mates refuse to let sonics define them.",
                "score": 85
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Stylus Magazine",
                "date": null,
                "content": "It's hard to argue with any album that possesses the virtues Z does: James' voice, one of the most astonishing instruments in rock; a band who, turnover notwithstanding, play like they've been doing this for decades; a sense of delight that often eludes young men with guitars; and songs that let you use the descriptor “rocks” without fear or shame.",
                "score": 83
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Tiny Mix Tapes",
                "date": null,
                "content": "What you can expect is what makes My Morning Jacket tried and true: bigger-than-life lyrics, classic rock swagger, and the need to move forward.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Slant Magazine",
                "date": null,
                "content": "Dialing down the reverb and allowing more wide-ranging influences to show through, My Morning Jacket fashions a messy, transitory record that's head-over-heels giddy, curiously experimental, and patently weird in equal measure.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Rolling Stone",
                "date": null,
                "content": "There is an emphasis on keyboards, in pulse and architecture, that adds buoyancy and color to James' writing and flatters his keening, stratospheric tenor.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Q Magazine",
                "date": null,
                "content": "Z proves they have not lost the magical intimacy that touched 2001's At Dawn and '03's It Still Moves. [Nov 2005, p.127]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Under The Radar",
                "date": null,
                "content": "Z is the point of light where My Morning Jacket loses any stereotype or easy niche, and instead becomes a huge, absolutely necessary rock band. [#11, p.108]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "No Ripcord",
                "date": null,
                "content": "An album you should definitely own, and a band you should definitely watch.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Magnet",
                "date": null,
                "content": "Diehards may crab about these more experimental sounds, but it's hard to find fault with the James gang for not only climbing out of its rut, but also leaving it far behind. [#69, p.104]",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Splendid",
                "date": null,
                "content": "The first My Morning Jacket whose songs reach the heights to which James's voice aspires.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Austin Chronicle",
                "date": null,
                "content": "Not as big and bright as 2003's It Still Moves, yet with the early-career sprawl edited out, Z's as lovingly worn as a vintage clothing score.",
                "score": 78
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": null,
                "content": "So Z abandons the Skynyrdisms of It Still Moves, but that album's lessons remain intact: Compared to those on previous albums, these tracks have more guitar crunch and tighter song structures.",
                "score": 76
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": null,
                "content": "While parts of previous My Morning Jacket albums sounded sloppy, Z is crisply-produced and markedly more refined, in part due to co-producer (with James) John Leckie.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Blender",
                "date": null,
                "content": "The band's warm way with weirdness remains; it's just flashier now. [Oct 2005, p.140]",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Guardian",
                "date": null,
                "content": "Unfortunately, four of the 10 tracks are deeply pedestrian, heartland rock....  Worse, presumably - like Charlotte Church - tired of having the voice of an angel, several songs find Jim James singing with the voice of a brickie.",
                "score": 60
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-17",
                "content": "This is their best record yet. A little discipline goes a long way.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2010-12-22",
                "content": "This is one of my favorite albums. It's simply amazing. Jim Jame's vocals are simply astounding. His voice is beautiful. This is in my top ten greatest rock albums I've ever heard. \"Wordless Chorus\" is just an amazing starter. You can really hear Jim's voice the best in that song. And \"Lay Low\", my favorite song on the album and one of my favorite rock songs I've ever heard, has THEThis is one of my favorite albums. It's simply amazing. Jim Jame's vocals are simply astounding. His voice is beautiful. This is in my top ten greatest rock albums I've ever heard. \"Wordless Chorus\" is just an amazing starter. You can really hear Jim's voice the best in that song. And \"Lay Low\", my favorite song on the album and one of my favorite rock songs I've ever heard, has THE greatest guitar solo I've ever heard. It's just awesome. All In All, This is one of my favorite albums to date and it never gets old. A… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-09",
                "content": "Opens really well with some catchy, leftfield, Flaming Lips/Merucry Rev-type tunes. But takes a serious nosedive somewhere around the middle. 'Off the Record' is such a MOR piece of crap that its hard to believe its from the same band as the excellent 'Anytime','Law Low' and 'Dondante' that close this album of two halves.",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-03-09",
                "content": "I bought this album based on this website and the reviews conained here. I am disappointed. It is not a stellar peice of work. Someone mentioned that the sound of the album is like from the bottom of a pool, and I agree. The mixing is way to heavy on reverb and echo, and the musicianship on the songs is lackluster at best. The riffs are ripped from other places, the hooks are muddy and I bought this album based on this website and the reviews conained here. I am disappointed. It is not a stellar peice of work. Someone mentioned that the sound of the album is like from the bottom of a pool, and I agree. The mixing is way to heavy on reverb and echo, and the musicianship on the songs is lackluster at best. The riffs are ripped from other places, the hooks are muddy and the singing is, well, not very good. James doesn't have good voice control, although he has a good range. I wanted this to be good, especially since I paid for it, instead of downloading it from Limewire. But, after the fourth listen, I don't think it will be in my computer or CD player any more. Disappointing.… Expand",
                "score": 4
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-04-10",
                "content": "This is a terrible album by a terrible group!",
                "score": 0
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-05",
                "content": "I bought this CD. It's chock full of poor songwriting and unclever ideas. They should have just Auto-Tuned his voice, it's just too off-key, esspecially on the stand-out track \"Gideon\". What I hated most was the boring pointless backwards sounds, the annoying soul-brother vocal soloing, and most of all - the humiliating \"nicknames\" they have for each other (written in the liner I bought this CD. It's chock full of poor songwriting and unclever ideas. They should have just Auto-Tuned his voice, it's just too off-key, esspecially on the stand-out track \"Gideon\". What I hated most was the boring pointless backwards sounds, the annoying soul-brother vocal soloing, and most of all - the humiliating \"nicknames\" they have for each other (written in the liner notes). I sold this CD back and got The New Ponographers \"Electric Version\"… Expand",
                "score": 2
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-01-13",
                "content": "simply boring",
                "score": 2
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-10-19",
                "content": "One of the most overrated albums of the year. There is no continuity and there is no execution. If you like reverb, which by the way is not a means of expression but a nob you turn up after you record your track, then listen to this. The first two songs are fun, catchy and well written. After that, it's filler to the end. The band doesn't know what it wants to be, and therefore, One of the most overrated albums of the year. There is no continuity and there is no execution. If you like reverb, which by the way is not a means of expression but a nob you turn up after you record your track, then listen to this. The first two songs are fun, catchy and well written. After that, it's filler to the end. The band doesn't know what it wants to be, and therefore, the results are mud and grey. You assume, with as much reverb and inability, the singer has that the lyrics would be great, but in fact they're indi-rock stupid. There are 3-4 songs on this album in which the lead guitar , bass guitar and drummer play the same notes throughout the entire song. It's ok computer for all the things that made ok computer not as good as it could have been..and not for the reasons that made it great.… Expand",
                "score": 3
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "Now this is truly great stuff.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-06-03",
                "content": "It's a good album but in the end you feel that some of the songs are either trying to make you like them or are just too similiar. Don't get me wrong MMJ as a band is brilliant but this album doesn't feel as good as some of their older stuff. But still it is an intelligent mix of pop, alt- country, southern rock and ambience that make this album one of the best of 2005.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-09-27",
                "content": "This is the album that they were meant to create. The album's leading up to this were training wheels for what is to come from this band after Z. They capture the very essence of Z in their live shows. I would recommend everyone that is a MMJ fan to please see them live. They get it and you will too.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-10",
                "content": "It's good to see the guys run in a different direction on Z. While it is a true departure from previous work, so was It Still Moves from At Dawn, and the latter from the Tennessee Fire. If anything, My Morning Jacket shows that they are a band that is growing. Especially with the addition of Carl and Bo, the Jacket is reaching into new ground. They have a truly Zeppelin-esque It's good to see the guys run in a different direction on Z. While it is a true departure from previous work, so was It Still Moves from At Dawn, and the latter from the Tennessee Fire. If anything, My Morning Jacket shows that they are a band that is growing. Especially with the addition of Carl and Bo, the Jacket is reaching into new ground. They have a truly Zeppelin-esque approach to the rock scene: take what you like, and make it your own, in a way that nobody's done it before. Who would've thought that \"I Needed It Most\" would have preceded \"Phone Went West\" on At Dawn, and now the tracklisting has \"Off the Record\" followed by \"Into the Woods.\" A rock-reggae trippy jam session followed by a beautiful demented circus waltz. And the thing is, it works. The album is encapsulating, and it ends as beautifully as it starts. Where we find outrselves thrown in with a mysteriously simple dance groove, we find the album closed with truly \"sad, mysterious dance music.\" Amidst the drum and bass groove, Jim sings in a gentle, subdued manner on \"Dondante,\" but builds and builds until you find that you're singing along with the guitar solo and get torn in two by the chorus. \"You had me worried...\" Simply reading the words cannot in any way, shape, or form express the sheer distress and frustration of this song. There is a power in this music, and it's one that you will rarely find in the music scene today. I challenge to put on headphones and close your eyes and listen to \"Dandante\" and not feel moved. I don't care if you hate Jim's voice, or listen to nothing but Slayer - this song will move with an emotional force that few bands today even come close to comprehending. And Jim, through \"Dondante\" and previous releases like \"Steam Engine\" and \"The Bear,\" has found a language that transcens mere vowels and consonants, but on a level of pure emotion.… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-10",
                "content": "this is an outstanding display of musical talent, and really shows how versatile the band has become.....",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-18",
                "content": "The best Album I've boughten this year. I only wish it were longer. MMJ has been one of my favorite artists for quite a while and they continue to improve with each release.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-23",
                "content": "It is among the best cd's of the year. great songs. great music. high class",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "A complete surprise. While some of Z sounds like their last and previous albums other songs find Jim James and the boys in new areas all together. It is kind of a weird little CD. \"It Still Moves\" part 2 would have been great, but I'm glad they're evolving.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "best album of 2005. absolutely wonderful... no words to say more...:)",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-20",
                "content": "One word to describe this album: concise. MMJ took the overly long songs from their previous albums and cut them down to little bits of perfection.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-02-14",
                "content": "Very good album...gives you the same great style, but with a faster beat. My Morning Jacket rose from the 'unknowns' with \"Still Moves\", but \"Z\" flowed much better. Good album...",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-08-07",
                "content": "Great album.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-10",
                "content": "What more can we ask? It's brilliant...good musicanship along with creative song lines.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-15",
                "content": "Is nice. I like.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-13",
                "content": "What a fabulous album!! They have really refined their style since 'It Still Moves'. The same great melodies and choruses are there, but the songs no longer degenerate into 8-minute jam sessions. In fact, I think the average track length has come down by 3 minutes....",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-05",
                "content": "Wow ... even if some tracks don't quite work, you can hear the urgency in the lead singer's voice - these guys are for real, or at the very least, they play a good game for 40 minutes. This is my first MMJ album, and I am more than impressed.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-01",
                "content": "Great album from one of the greatest live bands EVER.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-20",
                "content": "Great CD, I can listen to it over & over. I find the songs progress nicely from begining to end with great tempo, but i especially love the guitar solos in Laylow & Dondante. Jim James voice is piercing and brilliant the whole cd flows beautifully, the reason I'm not giving it a 10 is at 47 minutes it is a bit short, but it is worth it. This, just like any other cd, is one that you Great CD, I can listen to it over & over. I find the songs progress nicely from begining to end with great tempo, but i especially love the guitar solos in Laylow & Dondante. Jim James voice is piercing and brilliant the whole cd flows beautifully, the reason I'm not giving it a 10 is at 47 minutes it is a bit short, but it is worth it. This, just like any other cd, is one that you either love or hate, and I love it.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-02",
                "content": "Z is definitely a tighter and more sonically pleasing album compared to the last one, It Still Moves. I love Jim James' voice and the reverb works more to the albums favour here than it did before. Drums have some great rythms, addition of keys is a big plus! Gets an 8 because one song (Track 6) is not so great; doesn't hurt the flow of the album though. Go buy it and see them Z is definitely a tighter and more sonically pleasing album compared to the last one, It Still Moves. I love Jim James' voice and the reverb works more to the albums favour here than it did before. Drums have some great rythms, addition of keys is a big plus! Gets an 8 because one song (Track 6) is not so great; doesn't hurt the flow of the album though. Go buy it and see them rock live! Bring back the 70s hair!… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-03",
                "content": "Is this case I am rating this album based on previous MMJ material. They focused on 3 great tracks and the rest of the album is just nothing.",
                "score": 1
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-24",
                "content": "Looking forward to many more amazing releases",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-20",
                "content": "I was amazed to see this album rush straight to top of 2005 (and indeed into the all time top 10). Given that this album has scored higher than the likes of Illinios, CYHSY or The Woods means it must be pretty special. Right? Right? But now that I've listened to Z, I'm sorely disappointed. This is not even close to the best of 2005. I'll admit that Z has a strong start, but I was amazed to see this album rush straight to top of 2005 (and indeed into the all time top 10). Given that this album has scored higher than the likes of Illinios, CYHSY or The Woods means it must be pretty special. Right? Right? But now that I've listened to Z, I'm sorely disappointed. This is not even close to the best of 2005. I'll admit that Z has a strong start, but 'Into The Woods' is a such a weak song (with obnoxious sound effect samples to boot) that it spoils the momentum of the first 5 songs, and the last half can only make a half-hearted attempt to recover. After about 5 or 6 listens to Z, I have no inclination to listen to it again past the catchy 'Wordless Chorus'. The reverb over the nasal vocals becomes irritating on many tracks, and in many places the tunes are gratingly immature (for example, the start of 'What A Wonderful Man' or \"Into The Woods'). Calling things you don't like overrated is a bit of a cliche around here (almost as much as giving something 10 and calling it album of the year), but the fact is that Z really is overrated, dammit.… Expand",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-04",
                "content": "this is pretty good. it's not the direction i was expecting or hoping they would take. but that's not necessarily a bad thing. the songs and sounds just don't quite grab you and immerse you like those on it still moves or at dawn did. it just doesn't sound as 'big.'",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "Different, Excellent!!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "Simply amazing album, ...even though the U2ishness of Gideon and Anytime seems a bit out of place.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "One of the Best Bands on the planet.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-06",
                "content": "simply awful. Another record that proves that they had one great, and by that i mean the truly brilliant, wonderful, spectacular \"At Dawn.\" After that it's been heading downhill at a remarkable pace. The only question left, is just how bad will they become, cause this pretty bad.",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-06",
                "content": "A darker, more electronic feel than their previous albums, but all the better for the sharp production values. Still with plenty to please the old fans, though, and some great air guitar moments. Their best album yet, and one of the best so far this year.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-07",
                "content": "\"The Coolest Album of the Year\" includes the best track of the year \"Off the Record\". If you like this also indulge in this year's most left field release The Free EP from The New Lows.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-07",
                "content": "Amazing, gets better and better with each listen. Captures the feel of their live performance better then any of their previous efforts.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-07",
                "content": "this album rocks",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-09",
                "content": "A wonderful addition to the MMJ catalog. Whereas the last album (It Still Moves) featured long sweaty jams, this album is a little tighter--although \"Lay Low\" and \"Dondante\" have a similar design. This is one of those albums in which every song is great. There is definitely no filler here. Jim James is a genius and an excellent vocalist. If you haven't checked out My Morning Jacket, A wonderful addition to the MMJ catalog. Whereas the last album (It Still Moves) featured long sweaty jams, this album is a little tighter--although \"Lay Low\" and \"Dondante\" have a similar design. This is one of those albums in which every song is great. There is definitely no filler here. Jim James is a genius and an excellent vocalist. If you haven't checked out My Morning Jacket, you need to get to it!… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-10",
                "content": "Fantastic Cd, just skip \"into the woods\" and you got a solid listen from cover to cover. Dont miss a chance to see these guys live, Amazing!",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-04",
                "content": "Reminds me of Little Feat and The Allman Brothers.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-03-05",
                "content": "Continuation of \"It still moves\"...more so than less so. Tracks are tighter, solo singing is better, song writing demonstrates more talent. However, with that said, this doesn't bring the listener any closer to \"listener glory\" than their other recording mentioned previously. Good but certainly not great.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-04-07",
                "content": "I wont be the first to throw it out there. It's no new masterpeice. It only shows potential to be one. Sonically, it's bold, brillaint and incredibly listenable. Vocally, however, There is a different side. There is a clear lack of diction that causes repeate listens to be trying. Listen to it as a peice, not song for song. It'll be more satisfying that way. It's good, I wont be the first to throw it out there. It's no new masterpeice. It only shows potential to be one. Sonically, it's bold, brillaint and incredibly listenable. Vocally, however, There is a different side. There is a clear lack of diction that causes repeate listens to be trying. Listen to it as a peice, not song for song. It'll be more satisfying that way. It's good, great even. No masterpeice, not yet… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-06-02",
                "content": "I've never been a big fan of the band. There are too many similar sounding bands out there that I think do it better. But with this new album, MMJ's sounds does change dramatically. I've read some unwarranted claims of them souding like Radiohead or that they will be the new American Radiohead. That just is not so. They aren't in the same league. The vocals and the I've never been a big fan of the band. There are too many similar sounding bands out there that I think do it better. But with this new album, MMJ's sounds does change dramatically. I've read some unwarranted claims of them souding like Radiohead or that they will be the new American Radiohead. That just is not so. They aren't in the same league. The vocals and the music are much more akin to The Flaming Lips. In fact, parts of this album would be a better follow-up to Yoshimi than the latest offering from Flaming Lips. Still, musically, I enjoyed this CD very much.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-08-03",
                "content": "A slice of genius. Just as good as Illinois, metacritics 2005 number 1. But in a different way. There are some fantastic songs on this album with. No filler. However some are more fantastic than others. Into the woods lets you down a little but then you hear the other half of the album and when you think the album could dip it lives up to the first half. I feel guilty giving this 9 and A slice of genius. Just as good as Illinois, metacritics 2005 number 1. But in a different way. There are some fantastic songs on this album with. No filler. However some are more fantastic than others. Into the woods lets you down a little but then you hear the other half of the album and when you think the album could dip it lives up to the first half. I feel guilty giving this 9 and not a 10. Brilliant… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-07-16",
                "content": "Simply one of the best albums made in the last 10 years.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-01-02",
                "content": "Easily the best album of the year, if not the decade.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-05-06",
                "content": "Best album of 2005. 4th best of all time. Perfect mix between Pink Floyd, Led Zep and Neil Young, but in a modern jacket.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-06-23",
                "content": "This is simply an incredible album. Every song sounds different but they all come together in a strangely cohesive way. Lay Low, Wordless Chorus, It Beats 4 U and Dondante are genius and you owe it to yourself as a fan of quality music to pick this stellar album up. I'm sure glad I did.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-01",
                "content": "One of the best albums of the year. Indie pop mixed with trippy Pink Floydish guitar meandering. I love this CD.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-01",
                "content": "AWESOME ALBUM. JIM JAMES IS AMAZING. similiar to a modern day led zeppelin. check out It Still Moves too!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-01",
                "content": "The first 20 seconds had my attention, after that i stopped caring. It isnt terrible, but it is in no way memorable.",
                "score": 4
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-14",
                "content": "Album of the year.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-10",
                "content": "great album-likely my favorite of the year, for what it's worth.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-11",
                "content": "Best album of the year",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-21",
                "content": "I love it. Overall, I find it very relaxing to listen to, yet some of the parts are soooo rocking. You can cite a million influences for these guys, but they blend them together so wonderfully (although, I don't quite understand where all this Radiohead talk is coming from?)",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-22",
                "content": "terrible sound",
                "score": 2
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-25",
                "content": "Seems like this is the chic pick of the year. Seems like everyone is trying way too hard to be chic. This album plays like nails on a chalkboard.",
                "score": 1
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-13",
                "content": "Most overrated album of 2005. I have all of the reverb used on this disc. And what's with the circus music on track six?! Blah.",
                "score": 1
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-30",
                "content": "Since OK Computer alt-rock has been getting closer to a digital age Sgt. Pepper. Although I think the Radiohead comparison amongst 90% of critics with this band is hideously misplaced, Z maybe getting all the more closer to that bull's eye",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-04",
                "content": "Great, great album! I enjoy it more with every listen!",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-14",
                "content": "This album definitely requires repeated listens. At first, I thought it was only decent and would have given it a 7 probably had I posted the first week that it came out. But, after a week and a half of playing it every day, I can say that while not the best of the year, or even top ten probably, it is very good.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-15",
                "content": "Z is a leaner and cleaner refinement of their trademark sound. MMJ has evolved from alt-country beginnings to a more universal, rootsy indie-rock. They selected only their very best songs for this album and reined in the urge to jam for too long. The result is their most consistent and appealing album to date. It should please longtime fans, and provides a great introduction for Z is a leaner and cleaner refinement of their trademark sound. MMJ has evolved from alt-country beginnings to a more universal, rootsy indie-rock. They selected only their very best songs for this album and reined in the urge to jam for too long. The result is their most consistent and appealing album to date. It should please longtime fans, and provides a great introduction for newcomers. Undoubtedly one of the best albums of 2005.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-15",
                "content": "Very infectous - not the same atmospheric, country road sound that I guess made this band a name for itself, but one hell of a lot more fun - you don't have to be in a reflective mood to enjoy it. I might give it a 10 if it grows on me any more than it already has.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-15",
                "content": "Incredible. My Morning Jacket has evolved from a deep alt-country-rock band into a modern-day powerhouse. Z, for the lack of a better word, is perfect. Finally, Jim James's voice is allowed to shine and for the first time, the music and the arrangements are tight and cohesive. My Morning Jacket has successfully mastered the art of melody and they use their awesome powers to transform Incredible. My Morning Jacket has evolved from a deep alt-country-rock band into a modern-day powerhouse. Z, for the lack of a better word, is perfect. Finally, Jim James's voice is allowed to shine and for the first time, the music and the arrangements are tight and cohesive. My Morning Jacket has successfully mastered the art of melody and they use their awesome powers to transform and lead the mind to wonderful places. Z is incredible. 50 years from now, when someone says \"My Morning Jacket\", they'll automatically associate them with this modern-day masterpiece that is \"Z\".… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-16",
                "content": "No thanks. Next...",
                "score": 1
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-18",
                "content": "I love the reverb. It has always given MMJ's sound a far away, etheral feel. Haunting was the word I typically use to describe the band. This looks like another positive gain for the corporate music scene which has taken the artistic vision of so many of the best indy bands in the world this past year. I'm talking about Sigur Ros and Death Cab specifically, but also (yes they I love the reverb. It has always given MMJ's sound a far away, etheral feel. Haunting was the word I typically use to describe the band. This looks like another positive gain for the corporate music scene which has taken the artistic vision of so many of the best indy bands in the world this past year. I'm talking about Sigur Ros and Death Cab specifically, but also (yes they have always been quasi coporate) coldplay, Iron and Wine, someone metioned Devhandra. They were at least interesting, now they sound like, well, U2. Not a good thing for creativity or, more importantly, soul. My point is this: yes MMJ had a good cross over album, and yes it is listenable, but what we lose are the ragged edges. There is beauty in imperfection. Corporate sound is clean, too clean so it can be mass marketed, mass consumed. This will be MMJ's best selling album, but it will never break my heart like At Dawn or even Tennessee Fire.… Expand",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-19",
                "content": "Very good Jacket LP. They r refining their sound - sounds polished (in a good way). They still sound like N.Young/Flaming Lips in an abstract way, and like those artists they continue to change/evolve.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-21",
                "content": "\"Z\" is one of the greatest records 2005. Every song on the record is special and full of details. If this album is their \"OK Computer\", \"It Beats 4 U\" is their \"Karma Police\".",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-21",
                "content": "\"boughten\"??",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-20",
                "content": "About as close to perfection as an album can get. Instantly listenable and amazingly varied. Truly there is a vision here: redemption, heartache, beauty. And somehow these disparate vignettes come together to create a larger picture that can only be understood when the album is considered as a whole. Forget the comparisons other \"reviewers\" have made. They transcend genres and won't About as close to perfection as an album can get. Instantly listenable and amazingly varied. Truly there is a vision here: redemption, heartache, beauty. And somehow these disparate vignettes come together to create a larger picture that can only be understood when the album is considered as a whole. Forget the comparisons other \"reviewers\" have made. They transcend genres and won't properly fit into the suprisingly narrow construct of \"Indie rock.\" Indeed, MMJ have created something more substantial and substantive than anybody expected, and we're all better off for it.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-21",
                "content": "Awesome! I had heard of MMJ before, but steered clear to avoid the C&W influence that just veered their big sound away from my true comfort zone, but 'Z' is magnificent. Like Pink Floyd with a sense of humour, Sigur Ros with lyrics and songs and Radiohead without the obnoxious, self-importance. I LOVE Z.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-19",
                "content": "Great album! I've enjoyed it thoroughly. At least five of these songs would fit nicely on The Soft Bulletin though... mind you, sounding like The Flaming Lips is quite an accomplishment... so this is not ground-breaking stuff. And I agree that any reference to Radiohead's OK Computer is so far off the mark that one should have his Music Reviewer Licence revoked. Does it sound Great album! I've enjoyed it thoroughly. At least five of these songs would fit nicely on The Soft Bulletin though... mind you, sounding like The Flaming Lips is quite an accomplishment... so this is not ground-breaking stuff. And I agree that any reference to Radiohead's OK Computer is so far off the mark that one should have his Music Reviewer Licence revoked. Does it sound like OK Computer? Not in the least. And anyway, Radiohead had The Bends in their rear-view mirror before recording OK Computer... so making OK Computer was just a techo-glitchy extension of that effort. Is this really the case with My Morning Jacket? Not from what I've heard.… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-02",
                "content": "How come none of these reviews seems to mention the striking similarity of the singer's voice to that of the Flaming Lips' Wayne Coyne???",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-20",
                "content": "I like to see how an album stands up over time and repeated listens, but its gonna be up there for albums of the year. A great smoky 70's rock rhythm, but the oompah band (also feat M.Ward) on track 6, into the woods detracts from the rest for me. Maybe they wanted to break things up, maybe one of them's an acid freak and they had to let him contribute one track, I dont know, I like to see how an album stands up over time and repeated listens, but its gonna be up there for albums of the year. A great smoky 70's rock rhythm, but the oompah band (also feat M.Ward) on track 6, into the woods detracts from the rest for me. Maybe they wanted to break things up, maybe one of them's an acid freak and they had to let him contribute one track, I dont know, but i'll be setting a playlist to remove track 6.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-05",
                "content": "Great album from a band with lots of potential. The comparisons to OK Computer are way off base, however. I think this sounds like a more accessible version of The Soft Bulletin by The Flaming Lips. Certain songs are also reminiscent of U2 and The Who. Though, mostly, this is a fine and original LP worth picking up. I don't understand any haters out there. This is the kind of album Great album from a band with lots of potential. The comparisons to OK Computer are way off base, however. I think this sounds like a more accessible version of The Soft Bulletin by The Flaming Lips. Certain songs are also reminiscent of U2 and The Who. Though, mostly, this is a fine and original LP worth picking up. I don't understand any haters out there. This is the kind of album that makes me happy to be alive.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-26",
                "content": "If it wasn't for the kitten on fire and baby in a blender I would have given this album a 10. I've been listening to it a lot of times and I don't even mind those lines that much anyway. The album is great. A couple of songs more, of that quality would have been wonderful.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-27",
                "content": "whats with the band bashing.. Steve-o you suck and MMJ rocks my socks off",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-08",
                "content": "there are a couple good tracks here, but what really ruins the album for me is the classic rock guitar solos. That needs to go. its not original or even well done. its tacky and boring",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-05",
                "content": "This album is a much needed breather in today's crap filled air.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-06",
                "content": "I am truly in awe. This album is breaktaking, inspiring and downright gorgeous. Quite frankly, this album could reaffirm your faith in music as the art form that should always take precedence over the revenue generator. If \"It Still Moves\" was brilliant, then this is exceptional and without a doubt in my mind an album that I will cherish for a long time to come. It's only blemish has I am truly in awe. This album is breaktaking, inspiring and downright gorgeous. Quite frankly, this album could reaffirm your faith in music as the art form that should always take precedence over the revenue generator. If \"It Still Moves\" was brilliant, then this is exceptional and without a doubt in my mind an album that I will cherish for a long time to come. It's only blemish has nothing to do with the band or the music; it is indeed the record label folks. Once again RCA has implemented copy protection protocols that will not allow you to rip your CD without the use of MS DRM protected WMA's. What if I own an iPod like MILLIONS of us out there you ask? Well, luckily there are ways to circumvent this attrocity of privacy infringement; none if which I can get into here. I digress. Superlative effort gentlemen.… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-07",
                "content": "I read one review that said this was MMJ's Ok Computer. It's a good album, but nowhere near that good.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-08",
                "content": "Wow! I really enjoy this album. A lot. I think the first 5 songs are all really good. The next five are a little inconsistent and number 6 throws the last five out of place a little, but it is, in my opinion, a truely great album.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-09",
                "content": "It had me reaching for the last album at first but after the 11th time I played it through it stuck. I was in the water surfing and I found the album stuck in my head. I have been playing the album in the shop I run.. Everyeyone wants to know what it is? I tell them \"you should see them live\"!",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-09",
                "content": "Bought this on the strength of the amazing reviews its been receiving. \"Wordless Chorus\" sounded nice. After that the echo chamber vocals begin to grate...",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-01",
                "content": "I feel like I've been waiting my whole life for this album!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-18",
                "content": "A high nine= 9.8",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-12-28",
                "content": "Great album. Definite grower...may sound a bit strange at first but once you listen to it more you appreciate its nuances and little oddities. Not to mention that these guys are AMAZING live. That made me appreciate this album all that much more.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-05",
                "content": "Just listen to \"What a Wonderful Man\"",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-01-07",
                "content": "This album has some fantastic tracks, and the band works wonderfully together. However, some tracks such as \"It Beats 4 U\" and \"Into the Woods\" are a little bit ugly for such a pretty-sounding record.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-02-24",
                "content": "A very solid 9!!I have always loved MMJ's original sound. But this new record is so different than its predecesors. I hear so many different sounds in each song. Off the Record reminds me of an old Replacements song but it is so obviously MMJ. That is so cool. And the keyboards and vocals in Gidion are moving. Any way, I am very proud to be from Louisville.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-06-23",
                "content": "an astonishing album! Wonderful man Dondante are among my favourites.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-06-24",
                "content": "amazing",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-02-03",
                "content": "I would like to vote 10 on this release from my recent favorite rock band MMJ, just to offset the 0-2 votes here. Z is obviously not a 0-2, and those who rate it that simply can't appreciate the talent that Jim James and MMJ display. Either that or they grew up in the 70's and are stuck there and anything after that has been a \"copy cat\". It is true that MMJ borrows alot from I would like to vote 10 on this release from my recent favorite rock band MMJ, just to offset the 0-2 votes here. Z is obviously not a 0-2, and those who rate it that simply can't appreciate the talent that Jim James and MMJ display. Either that or they grew up in the 70's and are stuck there and anything after that has been a \"copy cat\". It is true that MMJ borrows alot from 70's rock. In fact many groups borrow from 70's and 80's music nowadays, but few can take the music they love, add their own flair and pull it off. MMJ is one of the few. This CD is an instant classic and will be one of the revered recordings of this decade. The reverb is still persent, but not as glaring in previous efforts, and the newly revamped band rocks out, especially on Anytime and What a Wonderful Man. There are a couple of weaker tracks on the CD, but are overshadowed by the highlights like Gideon and Anytime. MMJ uses keyboards more often and effectively than peviously and the result is a more well rounded sound on two of my personal favorite tracks It Beats 4 U and Wordless Chorus. The CD closes with the epic Dondante. As a sidenote, I caught MMJ at the Avalon in Boston, and they were just as good as on Okonokos. I recommend seing them soon before they headline Amphiteaters. MMJ truly is a great American rock Band.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-03-14",
                "content": "I'm not one to over-rate; the more I listen to this album, the more it grows on me. It's incredible that they managed to master so many different types of music on one album, from prog (Dondante) to an almost reggae sound (Off the Record). I hope that this is just the beginning.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-01-24",
                "content": "One of the best in decade!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-05-08",
                "content": "This album is a classic.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-11",
                "content": "Numbers 2, 8,9,10 over and over until you have your fill then just let it run in your car full time. The jacket's best work to date. its scary how good this band is.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-10",
                "content": "Maybe it's just me, but I hear some of The Who in here. Great album!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-01",
                "content": "Tedious leaden retread of seventies space rock - still - I prefer my space rock a little scarier and grandiose - many obviously enjoy this more gentle and humble fare. To me, the Guardian gets it right: pedestrian.",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-13",
                "content": "The first three tracks are as brilliant as anything on OK Computer or The Soft Bulletin. Had they made a whole album like that I would have hailed it a masterpiece. The rest is often good stuff but as an album it lacks consistency and coherence...and some of the guitar parts are rather dullas well. But boy can jim james sing!!",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-12",
                "content": "a curve ball. maybe the new direction of this band. songs like 'i will sing you songs' had a lot of people thinking these guys were the american rock version of sigur ros. they're not. this album is really very good. probably should be an 8. but i just can't help being disappointed by it every time i listen to it, and am baffled by the 100s it's receiving from so a curve ball. maybe the new direction of this band. songs like 'i will sing you songs' had a lot of people thinking these guys were the american rock version of sigur ros. they're not. this album is really very good. probably should be an 8. but i just can't help being disappointed by it every time i listen to it, and am baffled by the 100s it's receiving from so many critics. i guess it's just the de rigueur thing to do. it's got some good songs but no great ones. they don't work as well together as i want them to. and then there's 'into the woods.' i declare 2005 the year of whimsy. everyone's getting a little carried away with their muses. devendra banhart just floated away with it on cripple crow, and mmj does the same on this album. there's little weight here. there's less depth. there's no hook as grand as just because i do or mahgeetah. the reverb (which some people are still complaining about) has been toned down too much. it's too heavy on the slick and too light on the atmosphere.… Expand",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-12",
                "content": "Z was the CD I most anticipated this year. Unfortunately, it fails to move me like It Still Moves and At Dawn both of which I still listen to repeatedly. Good CD? yes, but I haven't listened to it for a few days.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-22",
                "content": "Best album since Pearl Jam VS.(1993).",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-03",
                "content": "One of, if not, the best album of the year!!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-04",
                "content": "It's always a joy to stumble across an album and a band that you have no idea about and end up loving it all. It's a slow burner, that initially interests and then grabs you.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-15",
                "content": "There aren't any bad songs on this disc, and a few (\"Off the Record\" and \"Knot Comes Loose\" leap to mind) are simply gorgeous. There are only a couple real rock songs, and they work pretty well, but the slower tracks are the album's real strength. Great album overall, behind only The National for my favorite of the year so far. I'd have voted it 10 if I hadn't had to There aren't any bad songs on this disc, and a few (\"Off the Record\" and \"Knot Comes Loose\" leap to mind) are simply gorgeous. There are only a couple real rock songs, and they work pretty well, but the slower tracks are the album's real strength. Great album overall, behind only The National for my favorite of the year so far. I'd have voted it 10 if I hadn't had to spend a a half-hour trying to bypass the copy protection so it could even play properly on my computer (a weird side-effect of Sony/BMG's war with Apple).… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-05",
                "content": "I was pleasantly surprised upon first listen but after several spins Z feels pretty bloated and smacks a little too heavily of Radiohead or an overproduced Flaming Lips. Even the artwork screams Kid A. Let's just hope this leads somewhere good and not just to another arena rock cliche.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-07",
                "content": "Rarely is there an album this full of majesty and grace. From the beginning of \"Wordless Chorus,\" we know we're in for a ride. \"We are the innovators, they are the imitators\" indeed--these guys will have plenty of followers. The album snakes through beauties like \"It Beats 4 U\" and \"Gideon\", rockers like \"What A Wonderful Man\" and \"Off the Record\". Then there's \"Dondante\"--as Rarely is there an album this full of majesty and grace. From the beginning of \"Wordless Chorus,\" we know we're in for a ride. \"We are the innovators, they are the imitators\" indeed--these guys will have plenty of followers. The album snakes through beauties like \"It Beats 4 U\" and \"Gideon\", rockers like \"What A Wonderful Man\" and \"Off the Record\". Then there's \"Dondante\"--as dark as Pink Floyd, as ethereal and haunting as Neil Young, this is one of the best songs released on album since...well, since MMJ's own \"One Big Holiday\" in 2003. This is a band at the top of their game, but we should be seeing the game rise even higher. Having seen them live right after this was released, i can attest to the fact that they are as good of a band as there is out there. These guys are the real deal.… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-11-09",
                "content": "MMJ has made stellar albums in years past, particularly It Still Moves, but never before have they crafted together sonic elegance and downright southern grittiness so beautifully. Falsettos galore make this truely an awe-inspiring listening experience.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-15",
                "content": "great.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-16",
                "content": "i agree with what jim said below a few comments. this album is like a more excessible, rockier soft bulletin. flaming lips come to mind a lot, but not too much to the point where they sound like a knock off band. z is a good album, one of the best of the year, but no necessarily earth shattering, and though soft bulletin is comparable to ok computer, it's not soft bulletin, just i agree with what jim said below a few comments. this album is like a more excessible, rockier soft bulletin. flaming lips come to mind a lot, but not too much to the point where they sound like a knock off band. z is a good album, one of the best of the year, but no necessarily earth shattering, and though soft bulletin is comparable to ok computer, it's not soft bulletin, just closer to soft bulletin than to ok computer in sound and style.… Expand",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-21",
                "content": "An Allman Brothers for the 21st century. A terrific pop record and how often can you say that?",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-20",
                "content": "An amazing work from a band who continues to reinvent itself with every ablum they release.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-23",
                "content": "Best album of the year with Broken Social Scene's BSS. I just can't take it out of my cd player.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-27",
                "content": "How is this such a leap forward from 'It Still Moves'? That album is infinitely better. #2 on 2005 Metacritic must mean that the crits all got together, listened to this misfire, and overrated it because of the formula. MMJ plays sensitive Americana rooted in the past (however the playing is nowhere near as good or inventive as Allman, Neil Young, etc), with a b.s. nod toward How is this such a leap forward from 'It Still Moves'? That album is infinitely better. #2 on 2005 Metacritic must mean that the crits all got together, listened to this misfire, and overrated it because of the formula. MMJ plays sensitive Americana rooted in the past (however the playing is nowhere near as good or inventive as Allman, Neil Young, etc), with a b.s. nod toward progress (do you really think the electronics are 'groundbreaking' here?), they are one of the most well known underground acts in the country (they are on a major label, in beer commercials and bad Cameron Crowe movies, but have no chance of radio, MTV, or even the O.C.), and they have the right politics (opening for John Kerry last year). This makes crusty, old, 50-something tastemakers wet their pants in the boardrooms of Rolling Stone, Spin and Billboard. Don't believe the hype.… Expand",
                "score": 4
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-27",
                "content": "the first 3 songs are awsome. they have an icy cool sound that reminds me of some radiohead. but very original. but then the album suddenly takes a nose dive into pretty dull boaring 90's rock that reminds me of Bush. which is not a good thing.",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-28",
                "content": "Excellent album. One of the top 5 for 2005.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-24",
                "content": "Everyone- Please never compare this to Ok Computer again. Thanks, Your pal, People of taste",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-24",
                "content": "Good but not 9 or 10 good. MMJ moved me stirringly in the past but not so much here.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-05",
                "content": "DAMMMN good. Best of the year. Oh boy. Slightly ahead of Wolf Parade... That's all I've got to give. Mike F: that has a negative impact? As a Lips fan: weak.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-09",
                "content": "Absolutely amazing album from start to finish. MMJ draws upon a varied palette of influences yet still remains an undeniably unique force. Yes, I was also suprised to read all the professional reviews and never come across a Flaming Lips comparison - I guess the reviewers thought that was too easy so they'd have to go for something a little less immediate, like a few seconds that Absolutely amazing album from start to finish. MMJ draws upon a varied palette of influences yet still remains an undeniably unique force. Yes, I was also suprised to read all the professional reviews and never come across a Flaming Lips comparison - I guess the reviewers thought that was too easy so they'd have to go for something a little less immediate, like a few seconds that resemble Radiohead. I wouldn't mind if more bands tried to sound a little like the Flaming Lips - they're amazing too. \"Knot Comes Loose\" is one of the most beautiful songs I've heard in a while, and \"Wordless Chorus\" is brilliant. Z deserves to be on every year-end list.… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-10-29",
                "content": "Truly epic. I see and hear a lot of comparisons to Neil Young, the Band, etc. -- classic Americana. But, the songs soar into melodic, fuzzy guitar heaven, reminiscent of great British acts such as James, Coldplay, Radiohead, and Doves.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-10-12",
                "content": "I just found out about this band, and I have to say that this album is AMAZING! An instant classic.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-11-30",
                "content": "Z is definitely one of the best albums of 2005, and that says a lot because 2005 was a great year for alternativ music. Each track is so diverse and unique, beautifully composed, with fantastic lyrics. Lay Low is by far my favorite track, an epic tune that desrves praise!",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-12-18",
                "content": "9.5 really. Fantastic album. Nothing left to say!",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-12-07",
                "content": "I like this release so much that I intend to spend millions of dollars buying up all available copies of it so that no one else can have one.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-02-16",
                "content": "Its good, but in the top three of 2005? i dunno.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-02-16",
                "content": "This is NOT Kid A or OK Computer. This is Pablo Honey at the bottom of a pond, all surface like the bubble that transports a final frantic yawn. Distant as though a dream of a dream; finally inanimate, sealed and self-present.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-05-12",
                "content": "One of 2005's very best discs. Allow it to grow on you with entire listenings.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2006-06-13",
                "content": "This is by far one of the best albums ever! Every song is so unique and wonderful to listen to! It proves that music is an art.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-10-16",
                "content": "This is their best work!",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-12-30",
                "content": "A great album. Soaring proggy yet rootsy rock, with Jim James' Neil Young-esque falsetto and twirling jamming guitars creating a unique sound. Very good, and their best album to date.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2007-08-22",
                "content": "Awesome. Literally inspires awe in your ears, your heart and most importantly your soul. Each song reaches an orgasmic guitar solo crescendo.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-01-31",
                "content": "would be pretty sweet if they could make the background music of my life.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-08-13",
                "content": "This seems to me pretty much overrated. it doesn't take a lot of plays til it starts to bore you somehow.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2008-09-27",
                "content": "Perfect album for night drives. Note to half of the commenters: Stop comparing everything to Radiohead. Learn how to appreciate something without namedropping. Learn to do that and you'll be better than half of the so-called music critics out there. Can't you sit and listen to something and appreciate it for what it is? You fools would listen to Berlioz and say, \"Oh my. This Perfect album for night drives. Note to half of the commenters: Stop comparing everything to Radiohead. Learn how to appreciate something without namedropping. Learn to do that and you'll be better than half of the so-called music critics out there. Can't you sit and listen to something and appreciate it for what it is? You fools would listen to Berlioz and say, \"Oh my. This sounds an awful lot like Beethoven. What a poseur!\"… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-21",
                "content": "In short, \"Z\" is a masterpiece that will certainly stand the test of time to these ears. I have listened to this record quite a lot since the day it came out and continue to discover little pieces of ear candy each time I put it on. For the record, I too believe the Flaming Lips comparison an apt one, but that is not intended to imply \"Z\" is derivative. Like many great works of art \"Z\" is In short, \"Z\" is a masterpiece that will certainly stand the test of time to these ears. I have listened to this record quite a lot since the day it came out and continue to discover little pieces of ear candy each time I put it on. For the record, I too believe the Flaming Lips comparison an apt one, but that is not intended to imply \"Z\" is derivative. Like many great works of art \"Z\" is willing to show its influences, and there are many strewn about in this sprawling, beautiful sonic landscape, but it is in the blending of its influences where \"Z\" and MMJ find their voice. And, it is a heavenly voice indeed and one that rewards repeated listening. Like my favorite records of all-time, I expect \"Z\" to be revealing little nuggets of sonic pleasure and lyrical revelation to me for some time to come.… Expand",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-23",
                "content": "wow so overrated",
                "score": 5
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2005-12-27",
                "content": "I wish they would play this kind of shit on MTV instead of freakin' Ashlee Simpson or whateer her name is... j.t.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2011-12-07",
                "content": "Z is an impressive, near great album from My Morning Jacket. Don't make a judgement the first time you listen to it. It's very different from anything you've ever heard before from the band.  (Early) Pink Floyd, Radiohead, and Wilco all come to mind when I listen to the record.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2012-07-28",
                "content": "I barely discovered this band today, and I instantly fell in love...until I heard this album. First three tracks? Great.\r Everything else was garbage until I heard \"Lay Low,\" then the rest went back to being garbage.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2013-07-10",
                "content": "All around great album. Awesome tunes with a mellow/laid back feel. It's just great. The real jewels of this album are \"Dondante\", \"Wordless Chorus\", and \"Lay Low\". Highly recommended.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2020-07-27",
                "content": "Z is a great album in its own right, but feels almost too over rated. There are a few standout songs, but not enough for this to be critically accclaimed.",
                "score": 5
            }
        ],
        "title": "Z"
    },
    {
        "genres": [
            "Indie",
            "Rock"
        ],
        "artist": "Mystery Jets",
        "releaseDate": "2007-05-08",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": null,
                "content": "Honestly, none of it makes a lick of sense, but unlike, say, the Beta Band -- whose entire shtick was that the parts of their music never fit into a coherent whole -- there's a shapeliness to Zootime that suggests the record was constructed from some inscrutable blueprint that's just naggingly out of reach.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Under The Radar",
                "date": null,
                "content": "There is promise in these [new] tracks; however, they fail to truly add anything to the band's already impressive debut. [#17, p.86]",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Spin",
                "date": null,
                "content": "There's enough promise here to rattle more cages soon. [Jun 2007, p.94]",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Stylus Magazine",
                "date": null,
                "content": "It is an energetic, powerful, and enjoyable album where occasionally pretty invention is marred by the suspicion that a hit-making producer is on deck.",
                "score": 67
            }
        ],
        "title": "Zootime"
    },
    {
        "genres": [
            "Rap"
        ],
        "artist": "Denzel Curry",
        "releaseDate": "2019-05-31",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2019-06-21",
                "content": "In less than a half hour, Curry establishes himself not only as one of the most capable and exciting artists of his generation, but also worthy of a place in Miami's rap pedigree, right alongside the local icons who inspired this gem.",
                "score": 90
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2019-06-04",
                "content": "There are few forces more powerful than the feeling of belonging. In creating his stunning Miami rap opus, Denzel Curry taps into that, demonstrating that he belongs among its most distinguished representatives in the process.",
                "score": 83
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "HipHopDX",
                "date": "2019-06-26",
                "content": "ZUU is filled with entertaining records, but their relatively short runtimes often leave one yearning for more. This brevity is just minor quibble though when presented with rewind-worthy efforts such as “Ricky,” a creation named after Curry’s father.",
                "score": 82
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Exclaim",
                "date": "2019-06-27",
                "content": "Curry has come a long way since he blew up and has fully solidified his place in the game. If ZUU isn't in your rotation, you're sleeping.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Clash Music",
                "date": "2019-06-04",
                "content": "ZUU is an experience that transports the listener to a specific time and place. ZUU is further proof that Denzel Curry is one of hip-hop's most interesting and progressive MCs.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "New Musical Express (NME)",
                "date": "2019-06-04",
                "content": "Overall, he has created a musical representation of his upbringing in the Sunshine state, evoking its intricate culture. His mixture of smoother, dreamier beats in opposition with harder-hitting and chest-bouncing ones create an aural journey and explanation as to why he is “real-ass n***a from the 305”.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Consequence",
                "date": "2019-06-04",
                "content": "ZUU is Curry’s ASTROWORLD, unmistakably transporting us to a specific time and place and never apologizing for it. The 2019 summer snapshot may prove as ephemeral as the season it represents, but for Curry, it represents an important step in embracing the heart and changing the hatred of a city it’s clear he will never truly leave.",
                "score": 75
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "RapReviews.com",
                "date": "2019-06-04",
                "content": "Even though I said Curry raps more than his peers, I didn’t say he NEVER sings. He flips back and forth between both on tracks like the Rugah Rajh produced “Speedboat,” but the nice thing is that he’s not so heavily medicated and AutoTuned that you can’t follow along with his delivery.",
                "score": 70
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-06-06",
                "content": "Denzel proves to be one of the most consistent young rappers out there, putting out another great solid project. ZUU is a celebration of the birthplace of Curry - Florida, specifically Carol City. As in his other projects all the tracks are full of energy and intense crispy deliveries that are totally unique. In addition, Denzel's beat selection is better than ever and helps to transportDenzel proves to be one of the most consistent young rappers out there, putting out another great solid project. ZUU is a celebration of the birthplace of Curry - Florida, specifically Carol City. As in his other projects all the tracks are full of energy and intense crispy deliveries that are totally unique. In addition, Denzel's beat selection is better than ever and helps to transport the listener to his hometown.… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-07-31",
                "content": "ZUU looks that has been thinking to be listened rapidly (even because of its less than a half hour length), as its rhythm are nothing less that variations of the same beat, although samples and atmosphere gives it a little dynamic and Denzel Curry's rhymes and flows are inspired.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-07-14",
                "content": "Not as impressive as last year's Taboo but still a decent project that focuses more on hard hitting bangers than emotionally driven, dark social commentary. Denzel remains to be one of, if not, the best rapper of the new generation even if this album doesn't quite live up to his last project's greatness.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-07-28",
                "content": "Denzel comes with fun 29-minute album with trap banger after trap banger. Curry, as always, is remarkably consistent and to this point in his career is incapable of dropping a truly bad track. It's not as artistically dense as his other projects, but it's a showcase of Curry's energy, lyricism and flows.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-06-15",
                "content": "Zuu is a short but sweet, banger filled album that feels more like an extended EP. Denzel tackles his past and his youth in Carol City in this project with fantastic production and great flows. Tracks like ZUU, BIRDZ, WISH and especially RICKY make the experience really worth checking out. Although the skits placement in the album is a bit weird.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-07-18",
                "content": "Short and sweet. A really good attempt from Curry to switch up his sound and style from TA13OO. Smooth production that never feels boring or samey, and Curry’s delivery is as fierce and loud as ever. Brilliant album.",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-08-17",
                "content": "Not as conceptual or as grand as TA13OO but it's not trying to be. Very laid back love letter to Denzel's home town of Miami, Florida.\r Best Tracks: WISH, RICKY, SPEEDBOAT, ZUU, P.A.T\rWorst Tracks: Shake 88",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-08-26",
                "content": "It’a alright. Very different compared to his other projects and not always in the right ways. Taboo was a borderline masterpiece Zuu was the inevitable disappointing follow up.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-09-22",
                "content": "Not quite as deep as Taboo, but equally pleasing to listen to and doesn’t disappoint when it comes to hard bangers.  Another masterpiece from Denzel",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2020-02-25",
                "content": "Easily Denzel Curry's best album yet with bangers like Ricky and Speedboat, the album itself seems very polished and it's clear that a lot of care was put into this album. While some of the beats can be basic at times though, but an overall very solid album.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2021-02-24",
                "content": "i want to have sex with this album 9/10\ri want to have sex with this album 9/10\ri want to have sex with this album 9/10",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-10-23",
                "content": "While I still loved and enjoyed this album, it was a project, sound and style that really threw me off on my first few listens, but grew on me, quite a lot, as time and my listening continued. I was going into this project expecting a sound like the 'Mixtape Denzel Curry' I fell in love with listening to, and still do absolutely love. This is a sound, and atmosphere, that is totally newWhile I still loved and enjoyed this album, it was a project, sound and style that really threw me off on my first few listens, but grew on me, quite a lot, as time and my listening continued. I was going into this project expecting a sound like the 'Mixtape Denzel Curry' I fell in love with listening to, and still do absolutely love. This is a sound, and atmosphere, that is totally new and different for Denzel. Not only are the lyrics, stories and references back to his home city of Miami, Florida, very admirable, but also sonically, Denzel reached into another new direction and sound for this project. This total Miami sound and vibe he attacks for the first time is great for Denzel and honestly sounds fantastic. Tracks like 'P.A.T,' are a callback and a step forward for the loud, noisy and blaring sound that Denzel has perfected, and showed off that he's great at creating throughout his career, and it's very awe-inspiring to hear Denzel pushing this sound forward, once again. Also finally, 'P.A.T' is a fantastic closing track for this project, (like every one of Curry's closing tracks on his projects) and this makes me believe the man could do no wrong, and a very damn great job as a lead singer in a Rock or Metal band (please go through with that Denzel, I can only wish for that as of now), and over the years his' tracks like P.A.T, Narcotics and his' Bulls on Parade cover (and technically a song remix, with him including Verse 3 from his song 'SIRENS | Z1RENZ,' toward the conclusion of the song) are all great examples of how great Denzel sounds with a loud, deafening, scream while delivering his, or anyone's lyrics. Denzel truly is a generational talent, and one that has yet to release a bad project, whether it be a mixtape, EP or album. While I do not believe he is the best rapper currently creating the genre of music, he is very damn close, skill wise and 'project success/positivity wise' to the man who is the best rapper as of right now and of this generation, Kendrick Lamar, and if he continues on with the great work he's been creating since 2011, many more listeners will understand and agree with that statement. Does his unique, great sounding and distinct delivery work and sound good to all listeners? No. Does everyone who understands hip hop music and listens or critiques music understand, love and or see the great traits that Denzel brings to the hip hop landscape? Absolutely. Denzel's typical loud sound does not fit the ears of all listeners, but all of the individuals who understand music, and what makes music great are very in touch with Denzel and his music, sound and what makes him a fantastic rapper to get behind, watch climb up the ladder that is hip hop, and keep a close eye on as he continues his journey toward becoming universally known, as the best rapper, or simply just, artist, in 'the game,'  or just the field of music at the moment. This project is scarily one of Denzel's best and while it is not 'something big,' as Denzel would say and did say, it still is a  of great music and a short project that since release, I have listened to a large number of times.… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2022-01-06",
                "content": "ZUU is a celebration of the birthplace of Curry - Florida, specifically Carol City. As in his other projects all the tracks are full of energy and intense crispy deliveries that are totally unique. In addition, Denzel's beat selection is better than ever and helps to transport the listener to his hometown.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-06-17",
                "content": "I have no problem with the shorter fun album from Denzel. He put a lot of time and effort into Taboo and not every album needs to be a masterpiece. Besides, the bangers is what initially got me onto him when I first heard \"Zone 3\" from Nostalgic 64. The easy comparison for this is Vince Staple's FM! from last year, but this is better than that simply because the production is better andI have no problem with the shorter fun album from Denzel. He put a lot of time and effort into Taboo and not every album needs to be a masterpiece. Besides, the bangers is what initially got me onto him when I first heard \"Zone 3\" from Nostalgic 64. The easy comparison for this is Vince Staple's FM! from last year, but this is better than that simply because the production is better and Denzel fleshed out his songs more. The only exception to that is obviously the \"Bushy B Interlude\" that sounds like it had the potential to be an incredible, but then its just cut short. However, the biggest problem with this album is how inconsistent it is. Some of the songs, while there's not necessarily anything bad about them, just don't do much for me like \"Automatic\" and \"Carolmart\". Some of the features also stand out like a sore thumb. \"Wish\" is a great song with a catchy hook and a killer first verse from Denzel and then Kiddo Marv comes in and really drops the ball. The only two songs that are just straight up bad songs are Shake 88 and P.A.T., both with terrible features and premises that just don't do anything for me. The highlights on this album are essentially the entire first half. It's just banger after banger with incredible production and great energy and songwriting by Denzel. Its heavy on the bass and filled to the brim with sounds, never leaving any space empty. The only exception to that is Speedboat which is more stripped back consisting of mostly darker sounding piano, but Denzel still brings as much energy as any of the songs and creates a really catchy hook. I do want to point out how good he has gotten at choruses, even better than Taboo. The first 6 songs on this are all really catchy and fun songs. His singing even doesn't sound half-bad on \"ZUU\" and \"Wish\" which is something that I know bothered people before. This album is just really disjointed with the first half being damn near perfect and the second half being completely disposable. I ended up giving it 4 stars because the good outweighs the bad in my eyes but man, if he had kept working on this more and kept up the quality on the first half he could have surpassed even his last album.… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-06-25",
                "content": "It isn't on the same level as Ta13oo, but still a good album. I enjoy more songs on the album than expected before the album dropped. The promotional singles aren't the highlights of the album in my opinion. Carolmart and Shake88 are great.",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-08-30",
                "content": "This is a decent album with a handful of bangers. The production was also pretty solid.",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-08-21",
                "content": "The first 6 songs are excellent and the last 6 are great. Curry really sets himself apart from his peers by having rap songs with catchy hooks and good lyrical content.Standout tracks: SPEEDBOAT, RICKY",
                "score": 9
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-09-29",
                "content": "A definite step back from his last project, TA13OO, but still a quality project with is a more trap influenced album, with production from Tay Keith on the track \"AUTOMATIC\" and other banger type songs like \"RICKY\" and \"P.A.T.\"",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2020-03-07",
                "content": "Good album, but its nothing compared too Taboo, but even with that its Denzel Curry this man can't have a bad album. Their are many bangers.",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2020-01-18",
                "content": "A short, yet hard hitting, and exceptionally produced/written record. Not as impressive as Curry's prior record \"TA1300,\" due to limited material to unpack, but Curry's impressive lyricism and direction remains top notch. This record provides a short and intricate look into Curry's early life growing up. Melodic hooks, varied flows, and topical verses are highlights on this record. One ofA short, yet hard hitting, and exceptionally produced/written record. Not as impressive as Curry's prior record \"TA1300,\" due to limited material to unpack, but Curry's impressive lyricism and direction remains top notch. This record provides a short and intricate look into Curry's early life growing up. Melodic hooks, varied flows, and topical verses are highlights on this record. One of the best releases of 2019.… Expand",
                "score": 8
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2021-04-06",
                "content": "this album is a 7 this album is a 7 this album is a 7 this album is a 7 this album is a 7",
                "score": 7
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2021-04-19",
                "content": "one of the most capable and exciting artists of his generation, but also worthy of a place in Miami's rap pedigree. It isn't on the same level as Ta13oo, but still a good album. I enjoy more songs on the album than expected before the album dropped.",
                "score": 9
            }
        ],
        "title": "ZUU"
    },
    {
        "genres": [
            "R&B"
        ],
        "artist": "SZA",
        "releaseDate": "2014-04-08",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "DJ Booth",
                "date": "2014-04-22",
                "content": "Z is a mood piece, 10 homogenous tracks that breeze by and flow on a winning combination of sweet vocals, sweeter hooks, and the sweetest of melodies and instrumentals.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Exclaim",
                "date": "2014-04-22",
                "content": "Z is a quality beginning for a beguiling new artist with a fresh futurist sound.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Los Angeles Times",
                "date": "2014-04-22",
                "content": "Tthe album's reach is as powerful as its depth.",
                "score": 75
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Sputnikmusic",
                "date": "2014-04-22",
                "content": "The record offers moments, candid and clear, of Rowe before the fame that'll surely head her way. It’s an opportunity to see what this artist is all about today.",
                "score": 72
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Fact Magazine (UK)",
                "date": "2014-04-22",
                "content": "Z is billed as an EP, but that undersells the completion and cohesion of these 10 songs. Her voice may be gentle, the songs just left-of-center, but SZA’s lyrics demand attention.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "HipHopDX",
                "date": "2014-04-22",
                "content": "Z is strongest when SZA avoids usual Pop tropes. Too many songs are about being left brokenhearted, and don’t add much to what’s already been done.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pretty Much Amazing",
                "date": "2014-04-24",
                "content": "The main downfall of Z is a lack of strong lyricism. In the rare moments that the murk clears or the light becomes too bright, what lies behind is less graceful than what it seemed.",
                "score": 67
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Consequence",
                "date": "2014-04-22",
                "content": "What ultimately makes it stick, from the beaming hooks to the gossamer production, is the execution, how all the scattered pieces eventually jell until the puzzle is complete.",
                "score": 67
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The 405",
                "date": "2014-04-22",
                "content": "Z is promising but it seems that SZA's identity isn't truly clear as there are too many different styles competing to be heard.",
                "score": 65
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2014-04-29",
                "content": "Rowe seems even more like an instrument rather than a lead voice, but it's all comforting, if not revealing, made more for background or late-night listening than complete emotional immersion.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Tiny Mix Tapes",
                "date": "2014-04-24",
                "content": "SZA remains a captivating, interesting singer, but the focused singularity that made S such a rewarding listen is largely absent here.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "NOW Magazine",
                "date": "2014-04-22",
                "content": "SZA’s lyrics are impressionistic, and her melodies arrive in fits and spurts.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Spin",
                "date": "2014-04-22",
                "content": "SZA isn't lost when sharing a song with big names, but she doesn't seem interested in pulling them entirely into her own world either.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Pitchfork",
                "date": "2014-04-22",
                "content": "Z's biggest problem is that, despite choosing a sound that is soft and somnolent, SZA is too often overpowered by the music.",
                "score": 59
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": "2014-07-30",
                "content": "Apart from a few highlights, SZA’s latest work suffers from uninspired production, forgettable songwriting, and unfitting tacked on features.",
                "score": 50
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2018-03-18",
                "content": "SZA traz um ótimo EP para nós,com boas músicas e todo o sentimento da cantora.Obrigado SZA.",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2014-06-30",
                "content": "An above average start to an abstract, sweet, delicate side of R&B and soul music. SZA has no problem letting you know which feelings she's singing about, but I think she needs a little work on how she's expressing them through her singing. Also, the production needs to help here a little more, not saying the production is not class enough, but sometimes I feel that it either overshadowsAn above average start to an abstract, sweet, delicate side of R&B and soul music. SZA has no problem letting you know which feelings she's singing about, but I think she needs a little work on how she's expressing them through her singing. Also, the production needs to help here a little more, not saying the production is not class enough, but sometimes I feel that it either overshadows here, o leaves her all alone, walking on a thin line. The featurings on this album leave me wanting more, specially the Isaiah Rashad and Chance The Rapper ones, which leads me to think, SZA needs to work on making her solo stuff much more powerful and consistent. At the end of the day, I'm looking forward to her next project, wishing no more than improvement and endurance.… Expand",
                "score": 6
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2019-03-27",
                "content": "Z by SZA is an amazing EP. Every track is fantastic from start to finish. I love SZA performance on this EP and the features are on fire. Don't sleep on this EP. 10/10",
                "score": 10
            },
            {
                "scoreMax": 10,
                "authorType": "User",
                "publication": "MetaCritic",
                "date": "2018-07-06",
                "content": "Pretty bland in sense of song tones, but SZA does show her amazing voice and potential on this EP.",
                "score": 6
            }
        ],
        "title": "Z [EP]"
    },
    {
        "genres": [
            "Reggae",
            "Contemporary Reggae",
            "Reggae-Pop"
        ],
        "artist": "Ziggy Marley",
        "releaseDate": "2016-05-20",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "AllMusic",
                "date": "2016-07-06",
                "content": "Ziggy Marley, the LP, shares much in common with Robert Palmer's Pride, Black Uhuru's Chill Out, and even Gregory Isaacs' Night Nurse, as its diminutive, deft, funky, tight, electro-tinged, and sincere. With all these ingredients at just the volume, it's still one single or classic short of being the best-of Ziggy, but the cool temperament and empowering mood of the album offer a life-affirming soul massage through music.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Mojo",
                "date": "2016-07-06",
                "content": "The message songs are delivered from the heart. [Aug 2016, p.95]",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Uncut",
                "date": "2016-07-06",
                "content": "On the whole it struggles to strike a light, far less catch fire. [Aug 2016, p.78]",
                "score": 50
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The Guardian",
                "date": "2016-07-06",
                "content": "It’s rooted so firmly within his comfort zone that when he sings about revolution on Start It Up, it’s more eyebrow-raising than consciousness-raising.",
                "score": 40
            }
        ],
        "title": "Ziggy Marley"
    },
    {
        "genres": [
            "Rock",
            "Singer-Songwriter"
        ],
        "artist": "Zee Avi",
        "releaseDate": "2009-05-19",
        "reviews": [
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Paste Magazine",
                "date": null,
                "content": "Her arrangements are music-hall clever, her erudite lyrics reference the most arcane subjects, and her flapper-vampy voice camps up everything to the point of burlesque.",
                "score": 85
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "PopMatters",
                "date": null,
                "content": "The breadth of Avi’s influences is apparent on her self-titled debut album, but she still creates a unique and extremely charming persona of her own.",
                "score": 80
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Under The Radar",
                "date": null,
                "content": "Zee Avi is a gentle record, a good morning record, a future staple for the hungover or stressed out.",
                "score": 70
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "The New York Times",
                "date": null,
                "content": "Yet while the album includes its share of blandly pleasant songs--the kind that could position Ms. Avi as a less arty Feist--there are also glints of melancholy clarity that promise more.",
                "score": 60
            },
            {
                "scoreMax": 100,
                "authorType": "Critic",
                "publication": "Rolling Stone",
                "date": null,
                "content": "The Borneo-born Avi gives much of the album a warm, old-jazz feel, but flat lyrics like \"I shed tears I couldn't dry\" make several of the songs sound like woodshedding material.",
                "score": 40
            }
        ],
        "title": "Zee Avi"
    }
]